The  DocumentClosedEventArgs  type exposes the following members.
 Properties
Name  |   Description
Cancellable
 Indicates whether an event may be cancelled by an event delegate.
 (Inherited from  RevitAPIEventArgs  .)
DocumentId
 Id of the document that has just been closed.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from  RevitAPIEventArgs  .)
Status
 Indicates whether the action associated with this event succeeded, failed, or was cancelled (by an API event handler).
 (Inherited from  RevitAPIPostEventArgs  .)
 See Also
  DocumentClosedEventArgs Class
  Autodesk.Revit.DB.Events Namespace